<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"dev","backend":"7e8f8ca7c0a7ac388bf7a1f2e6e17da024fdb45e7e17576b96b9dede97475d9a","plan_job_ref":"Job Pull Request Checks #3689 at https://github.com/GSA-TTS/FAC/actions/runs/11000843420","plan_out_hash":"91205873307265653dc0d77a1857e2e8a081f52426319d33dc5a00bf217110b7","plan_hash":"500d966083805f752e45fe1d15baf1af5568a7c91a10f84a0a717a8b314c3e87","plan_text_format":"diff","version":"1.44.0"} -->
Terraform plan for __dev__
<details>
<summary>Plan: 2 to add, 1 to change, 1 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.dev.cloudfoundry_network_policy.logshipper-network-policy will be updated in-place
!~  resource "cloudfoundry_network_policy" "logshipper-network-policy" {
        id = "f188b467-82e6-e5d6-bae1-138086a288c5"

+       policy {
+           destination_app = "a6eb3870-2769-4aa9-a8f2-f1a31939f563"
+           port            = "61443"
+           protocol        = "tcp"
+           source_app      = (known after apply)
        }
    }

  # module.dev.module.cg-logshipper.cloudfoundry_app.cg_logshipper_app will be created
+   resource "cloudfoundry_app" "cg_logshipper_app" {
+       buildpack                       = (known after apply)
+       buildpacks                      = [
+           "https://github.com/cloudfoundry/apt-buildpack",
+           "nginx_buildpack",
        ]
+       disk_quota                      = 256
+       enable_ssh                      = (known after apply)
+       environment                     = (sensitive value)
+       health_check_http_endpoint      = (known after apply)
+       health_check_invocation_timeout = (known after apply)
+       health_check_timeout            = (known after apply)
+       health_check_type               = "process"
+       id                              = (known after apply)
+       id_bg                           = (known after apply)
+       instances                       = 1
+       memory                          = 256
+       name                            = "logshipper"
+       path                            = "../shared/modules/cg-logshipper/logshipper.zip"
+       ports                           = (known after apply)
+       space                           = "06525ba3-19c2-451b-96e9-ea4a9134e8b9"
+       stack                           = (known after apply)
+       stopped                         = false
+       strategy                        = "rolling"
+       timeout                         = 180

+       routes {
+           port  = (known after apply)
+           route = "0f1312b9-86cd-4090-aa48-05bc5db32a5e"
        }

+       service_binding {
+           service_instance = "03df74b7-065a-46df-9a85-0bac201bf36c"
        }
+       service_binding {
+           service_instance = "29c42cfd-0722-4152-858e-d16521f1a694"
        }
+       service_binding {
+           service_instance = "d79b8e4c-c1f5-4711-8172-5da3f9298cc4"
        }
    }

  # module.dev.module.cors.null_resource.cors_header must be replaced
-/+ resource "null_resource" "cors_header" {
!~      id       = "*******************" -> (known after apply)
!~      triggers = { # forces replacement
!~          "always_run" = "2024-09-23T17:53:59Z" -> (known after apply)
        }
    }

Plan: 2 to add, 1 to change, 1 to destroy.

Warning: Argument is deprecated

  with module.dev-backups-bucket.cloudfoundry_service_instance.bucket,
  on /tmp/terraform-data-dir/modules/dev-backups-bucket/s3/main.tf line 14, in resource "cloudfoundry_service_instance" "bucket":
  14:   recursive_delete = var.recursive_delete

Since CF API v3, recursive delete is always done on the cloudcontroller side.
This will be removed in future releases

(and 6 more similar warnings elsewhere)
```
</details>

:memo: Plan generated in [Pull Request Checks #3689](https://github.com/GSA-TTS/FAC/actions/runs/11000843420)